---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.MultistoryStairsComponentJoinFailure
source: html/2b772d35-b4ea-eec9-1cfd-0bfa32b43160.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.MultistoryStairsComponentJoinFailure Property

Can't keep elements joined. Avoid converting stairs to skeched-based component in Multistory stairs.

## Syntax (C#)
```csharp
public static FailureDefinitionId MultistoryStairsComponentJoinFailure { get; }
```